# taken from dh2en from a js library that doesnt actually work
# todo: make it work

_vowels = {
    "ަ": "a",
    "ާ": "aa",
    "ި": "i",
    "ީ": "ee",
    "ު": "u",
    "ޫ": "oo",
    "ެ": "e",
    "ޭ": "ey",
    "ޮ": "o",
    "ޯ": "oa",
    "ް": ""
}

_compounds = {}

_alif_compounds = {
    "އަ": "a",
    "އާ": "aa",
    "އި": "i",
    "އީ": "ee",
    "އު": "u",
    "އޫ": "oo",
    "އެ": "e",
    "އޭ": "ey",
    "އޮ": "o",
    "އޯ": "oa"
}

_consonants = {
    "ހ": "h",
    "ށ": "sh",
    "ނ": "n",
    "ރ": "r",
    "ބ": "b",
    "ޅ": "lh",
    "ކ": "k",
    "އ": "a",
    "ވ": "v",
    "މ": "m",
    "ފ": "f",
    "ދ": "dh",
    "ތ": "th",
    "ލ": "l",
    "ގ": "g",
    "ޏ": "y",
    "ސ": "s",
    "ޑ": "d",
    "ޒ": "z",
    "ޓ": "t",
    "ޔ": "y",
    "ޕ": "p",
    "ޖ": "j",
    "ޗ": "ch",
    "ޙ": "h",
    "ޚ": "kh",
    "ޛ": "z",
    "ޜ": "z",
    "ޝ": "sh"
}

_punctuations = {
    "]": "[",
    "[": "]",
    "\\": "\\",
    "\'": "\'",
    "،": ",",
    ".": ".",
    "/": "/",
    "÷": "",
    "}": "{",
    "{": "}",
    "|": "|",
    ":": ":",
    "\"": "\"",
    ">": "<",
    "<": ">",
    "؟": "?",
    ")": ")",
    "(": "("
}

